{"skills": [{"skill_name": "Python Fundamentals", "description": "Learn the basics of Python programming, including variables, data types, and basic operations.", "steps": [{"title": "Variables and Data Types", "explanation": "Understand how to declare variables and assign values of different data types like integers, floats, strings, and booleans. This is the foundation for storing and manipulating data in Python.", "exercise": "Create variables for your name, age, and height, and print their values.", "tip": "Choose descriptive variable names for better readability.", "sub_steps": [{"title": "String Manipulation", "explanation": "Learn to concatenate strings, slice them, and use built-in string methods. Strings are fundamental for working with text data.", "exercise": "Create a string variable, extract a substring, and convert it to uppercase.", "tip": "Use f-strings for easy string formatting.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 16:56:53"}, {"skill_name": "Basic Video Editing", "description": "Learn the fundamentals of video editing to create engaging content.", "steps": [{"title": "Import and Organize Footage", "explanation": "Import your video clips, audio files, and images into your editing software and organize them for easy access.", "exercise": "Create a new project in your editing software and import 3-5 short video clips. Create bins (folders) to categorize them.", "tip": "Use descriptive names for your files and folders to stay organized.", "sub_steps": [{"title": "Understanding the Interface", "explanation": "Familiarize yourself with the timeline, source monitor, and program monitor.", "exercise": "Locate these key panels in your software.", "tip": "Customize your workspace for optimal workflow.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 16:58:04"}], "streaks": ["2025-03-31"], "last_active": "2025-03-31"}