{"skills": [{"skill_name": "Python Fundamentals", "description": "Learn the basics of Python programming, including variables, data types, and basic operations.", "steps": [{"title": "Variables and Data Types", "explanation": "Understand how to declare variables and assign values of different data types like integers, floats, strings, and booleans. This is the foundation for storing and manipulating data in Python.", "exercise": "Create variables for your name, age, and height, and print their values.", "tip": "Choose descriptive variable names for better readability.", "sub_steps": [{"title": "String Manipulation", "explanation": "Learn to concatenate strings, slice them, and use built-in string methods. Strings are fundamental for working with text data.", "exercise": "Create a string variable, extract a substring, and convert it to uppercase.", "tip": "Use f-strings for easy string formatting.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 16:56:53"}, {"skill_name": "Basic Video Editing", "description": "Learn the fundamentals of video editing to create engaging content.", "steps": [{"title": "Import and Organize Footage", "explanation": "Import your video clips, audio files, and images into your editing software and organize them for easy access.", "exercise": "Create a new project in your editing software and import 3-5 short video clips. Create bins (folders) to categorize them.", "tip": "Use descriptive names for your files and folders to stay organized.", "sub_steps": [{"title": "Understanding the Interface", "explanation": "Familiarize yourself with the timeline, source monitor, and program monitor.", "exercise": "Locate these key panels in your software.", "tip": "Customize your workspace for optimal workflow.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 16:58:04"}, {"skill_name": "Cooking Chicken Biryani", "description": "Learn to prepare delicious and aromatic chicken biryani, a popular South Asian dish.", "steps": [{"title": "Prepare the Chicken Marinade", "explanation": "Marinating the chicken infuses it with flavor and tenderizes it. Combine yogurt, ginger-garlic paste, spices, and lemon juice with the chicken and let it rest.", "exercise": "Mix 1 kg chicken with 1 cup yogurt, 2 tbsp ginger-garlic paste, 1 tbsp biryani masala, 1 tsp turmeric, salt to taste, and juice of 1 lemon. Marinate for at least 1 hour.", "tip": "Marinate the chicken overnight for best results.", "sub_steps": [{"title": "Sauté Onions and Spices", "explanation": "Fry sliced onions until golden brown and add whole spices to release their aroma. This forms the base flavor of the biryani.", "exercise": "Heat oil, add sliced onions and fry until golden brown. Add bay leaves, cardamom, cloves, and cinnamon sticks and sauté for a minute.", "tip": "Fry onions evenly to avoid a bitter taste.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 17:34:34"}, {"skill_name": "Pokemon Identification", "description": "Learn to identify Pokemon based on their attributes.", "steps": [{"title": "Observe the Appearance", "explanation": "Note the Pokemon's color, shape, and any distinguishing features.", "exercise": "Describe Pikachu's appearance.", "tip": "Pay attention to details like ears, tails, and patterns.", "sub_steps": [{"title": "Identify Key Features", "explanation": "Focus on unique characteristics like horns, wings, or specific markings.", "exercise": "What is unique about Charizard's appearance?", "tip": "Consider what makes the Pokemon stand out.", "status": "not_started"}], "progress": 0, "status": "not_started"}, {"title": "Consider the Type", "explanation": "Determine the Pokemon's type (e.g., Fire, Water, Grass) based on its appearance and abilities.", "exercise": "What type do you think Bulbasaur is?", "tip": "Type often relates to the Pokemon's environment or powers.", "sub_steps": [{"title": "Learn Type Matchups", "explanation": "Understand which types are strong or weak against others.", "exercise": "Which type is effective against Water-type Pokemon?", "tip": "Use a type chart for reference.", "status": "not_started"}], "progress": 0, "status": "not_started"}, {"title": "Research the Pokedex", "explanation": "Use the Pokedex to confirm your identification and learn more about the Pokemon.", "exercise": "Look up a Pokemon in the Pokedex and read its description.", "tip": "The Pokedex provides detailed information about each Pokemon.", "sub_steps": [{"title": "Read the Description", "explanation": "Pay attention to the description, as it often contains clues about the Pokemon's identity and behavior.", "exercise": "What does the Pokedex say about Pikachu's cheeks?", "tip": "Descriptions provide context to physical attributes.", "status": "not_started"}], "progress": 0, "status": "not_started"}], "overall_progress": 0, "created_at": "2025-03-31 17:39:00"}], "streaks": ["2025-03-31"], "last_active": "2025-03-31"}